weather_cpp/catkin_ws/src/weather_cpp/include/weather_cpp/ndfdXMLBinding.GmlTimeSeries.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:ns2="http://graphical.weather.gov/xml/DWMLgen/schema/DWML.xsd"
  xmlns:ns1="http://graphical.weather.gov/xml/DWMLgen/wsdl/ndfdXML.wsdl">
 <SOAP-ENV:Body  SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns1:GmlTimeSeries>
   <listLatLon></listLatLon>
   <startTime>2017-01-18T03:45:48Z</startTime>
   <endTime>2017-01-18T03:45:48Z</endTime>
   <compType>IsEqual</compType>
   <featureType>Forecast_Gml2Point</featureType>
   <propertyName></propertyName>
  </ns1:GmlTimeSeries>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
